Ran Plan for 2 projects:

1. project: `project-demo` dir: `Terraform/quick_demo` workspace: `default`
1. project: `project-module-demo` dir: `Terraform/module_demo/project_1` workspace: `default`

### 1. project: `project-demo` dir: `Terraform/quick_demo` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_network.default will be created
+ resource "google_compute_network" "default" {
+       auto_create_subnetworks                   = false
+       delete_default_routes_on_create           = false
+       gateway_ipv4                              = (known after apply)
+       id                                        = (known after apply)
+       internal_ipv6_range                       = (known after apply)
+       mtu                                       = (known after apply)
+       name                                      = "wade-test-network"
+       network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
+       project                                   = "adept-presence-396401"
+       routing_mode                              = "GLOBAL"
+       self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `project-module-demo` dir: `Terraform/module_demo/project_1` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
exit status 3: running "terraform${ATLANTIS_TERRAFORM_VERSION} fmt -check=true -write=false -diff=true" in "/atlantis/repos/wadexu007/learning_by_doing/4/default/Terraform/module_demo/project_1": 
locals.tf
--- old/locals.tf
+++ new/locals.tf
@@ -1,7 +1,7 @@
 locals {
   # project details
   project = {
-    project_id  = "adept-presence-396401"
+    project_id   = "adept-presence-396401"
     region       = "asia-east2"
     network_name = "default"
   }


```
</details>

---

